[
  {
    "id": 1,
    "TitleOfProject": "phasmaphobia-ghost-filter",
    "githubLink": "https://github.com/gshaver82/phasmaphobia-ghost-filter",
    "deployedLink": "https://phasmaphobia-ghost-filter.herokuapp.com",
    "screenshot": "./phasmaphobiaFilterApp.png",
    "ProjectDescription": "This React web app will allow players of the game phasmaphobia to quickly filter out what ghost type they are dealing with. click once to confirm an evidence, and click again to exclude it. the program will automatically let you know which pieces of evidence are still relevant. for example, if freezing and EMF5 are confirmed checking spirit box and ghost writing is not needed. the only 2 ghosts left at this point both do not have spirit box and ghost writing.so, fingerprints and orbs will be noted with 'check this!' click the details button to expand on the info for each ghost if desired. playtested several times with great success!"
  },
  {
    "id": 2,
    "TitleOfProject": "Recipe Journal",
    "githubLink": "https://github.com/PeterBaker644/Recipe-Journal",
    "deployedLink": "https://project-3-recipe-box.herokuapp.com/",
    "screenshot": "./recipeBoxWebcam.png",
    "ProjectDescription": "Massive project. This app will let you store your favorite recipes along with ingredients (and auto populate most used ingredients for easy selection during recipe creation), and steps to make the recipe. The driving force for this app was to absolutely minimize typing. for example, ingredients a user creates are remembered and suggested only for that logged in user.  Technologies used: React, mongo, Oauth through firebase, firestorage, react webcam, animations, and styled components. "
  },
  {
    "id": 3,
    "TitleOfProject": "MixtapePlaylist",
    "githubLink": "https://github.com/PeterBaker644/Mixtape",
    "deployedLink": "https://project-2-mixtape.herokuapp.com/",
    "screenshot": "./MixtapePlaylist.png",
    "ProjectDescription": "Mixtape is a social media music sharing website built on node-express and MySQL. It has a simple interface for sharing and voting on playlists. Complex SQL queries and routing so that users can login, upvote and have upvotes properly tallied. example of the complexity: SQL table playlist that belongs to a user, has many upvotes and belongs to many songs.  It works... and its beautiful!"
  },
  {
    "id": 4,
    "TitleOfProject": "Note taker",
    "githubLink": "https://github.com/gshaver82/HW11NoteTaker",
    "deployedLink": "https://gene-note-taker.herokuapp.com/",
    "screenshot": "./NotesScreenshot2.jpg",
    "ProjectDescription": "this website will store notes to an external database and then read from, add to and delete from that database using APIs. also has async awaits"
  },
  {
    "id": 5,
    "TitleOfProject": "Satellite Flyover",
    "githubLink": "https://github.com/gshaver82/OfMonstersAndMen",
    "deployedLink": "https://gshaver82.github.io/OfMonstersAndMen/",
    "screenshot": "./SatFlyoverProjectSite.jpg",
    "ProjectDescription": "This site will allow users to search for satellites in view above thier location. this app is no longer fully working due to the n2y0 api now requiring CORS. From the screenshot you can see that i had the weather API and the satelite API working together to show you what sats were overhead, what direction to look and what the weather conditions were at the time. the Link not found at the bottom was for a paid API that linked the NORAD ID to the wiki for the satelite."
  },
  {
    "id": 6,
    "TitleOfProject": "MN Cryonics HR monitor",
    "githubLink": "https://github.com/gshaver82/cryonics-member-response-info",
    "deployedLink": "https://cryonics-member-response-info.herokuapp.com/",
    "screenshot": "./bar.png",
    "ProjectDescription": "This site will authenticate users, and allow them to link to a fitbit account. when a user loses HR this server will notify emergency contacts. fitbit syncing will passively monitor, and the clock face app that was developed separately will ping to this server if HR is lost. A member dashboard shows users status and alert status including GPS location"
  },
  {
    "id": 7,
    "TitleOfProject": "MN Cryonics HR monitor fitbit clockface app",
    "githubLink": "https://github.com/gshaver82/Fitbit-Clockface-HeartRateAlert",
    "deployedLink": "",
    "screenshot": "CryonicsMonitor-screenshot(4).png",
    "ProjectDescription": "This site will authenticate users, and allow them to link to a fitbit account. when a user loses HR this server will notify emergency contacts. fitbit syncing will passively monitor, and the clock face app that was developed separately will ping to this server if HR is lost. A member dashboard shows users status and alert status including GPS location"
  }
]